Repository: jochym/opendata
Catalog: src/opendata/i18n/*/LC_MESSAGES/messages.po
Languages: pl

source: OpenData Agent
pl: Agent OpenData

source: AI Configuration
pl: Konfiguracja AI

source: Sign in with Google
pl: Zaloguj się przez Google

source: This tool uses **Google Gemini** to help extract metadata safely. No API keys needed—just sign in.
pl: To narzędzie wykorzystuje **Google Gemini**, aby bezpiecznie wyodrębniać metadane. Nie są wymagane klucze API — po prostu się zaloguj.

source: Security & Privacy FAQ
pl: Bezpieczeństwo i Prywatność - FAQ

source: Agent Interaction
pl: Interakcja z Agentem

source: RODBUK Metadata
pl: Metadane RODBUK

source: Project Path
pl: Ścieżka Projektu

source: Analyze Directory
pl: Analizuj Katalog

source: Build Package
pl: Buduj Paczkę

source: Agent is thinking...
pl: Agent myśli...

source: Authorization failed. Please ensure client_secrets.json is present.
pl: Autoryzacja nie powiodła się. Upewnij się, że plik client_secrets.json jest obecny.

source: Continue on Mobile
pl: Kontynuuj na urządzeniu mobilnym

source: Read-Only: We never modify your research files.
pl: Tylko do odczytu: Nigdy nie modyfikujemy Twoich plików badawczych.

source: Local: Analysis happens on your machine.
pl: Lokalnie: Analiza odbywa się na Twoim komputerze.

source: Consent: We only send text snippets to AI with your permission.
pl: Zgoda: Wysyłamy fragmenty tekstu do AI tylko za Twoją zgodą.

source: Scanning {path}...
pl: Skanowanie {path}...

source: Type your response...
pl: Wpisz swoją odpowiedź...

source: No metadata yet
pl: Brak metadanych

source: Analysis
pl: Analiza

source: Protocols
pl: Protokoły

source: Package
pl: Paczka

source: Extraction Protocols
pl: Protokoły Ekstrakcji

source: This area will allow you to manage extraction protocols, including file exclusion patterns and hierarchical prompts.
pl: Ten obszar pozwoli na zarządzanie protokołami ekstrakcji, w tym wzorcami wykluczania plików i hierarchicznymi promptami.

source: Under Construction
pl: W budowie

source: Package Content Editor
pl: Edytor Zawartości Paczki

source: This area will provide an interactive file tree to manually include or exclude files from the final package.
pl: Ten obszar zapewni interaktywne drzewo plików do ręcznego włączania lub wykluczania plików z końcowej paczki.

source: Preview
pl: Podgląd

source: Settings
pl: Ustawienia

source: RODBUK Submission Preview
pl: Podgląd zgłoszenia RODBUK

source: This is how your project will appear in the RODBUK repository.
pl: Tak Twój projekt będzie prezentował się w repozytorium RODBUK.

source: Selected Files
pl: Wybrane pliki

source: List of files to be included in the package will appear here.
pl: Tutaj pojawi się lista plików, które zostaną włączone do paczki.

source: Application Settings
pl: Ustawienia Aplikacji

source: AI Model
pl: Model AI

source: Language
pl: Język

source: Mobile Access
pl: Dostęp Mobilny

source: Show QR Code
pl: Pokaż kod QR

source: AI Session
pl: Sesja AI

source: Logout from AI
pl: Wyloguj z AI

source: Open
pl: Otwarte

source: Data
pl: Dane
